package lr3;

/*8.	Напишите программу, в которой создается символьный массив из 10 элементов.
        Массив заполнить большими (прописными) буквами английского алфавита.
        Буквы берутся подряд, но только согласные (то есть гласные буквы ’ А',1Е' и ' I'
        при присваивании значений элементам массива нужно пропустить).
        Отобразите содержимое созданного массива в консольном окне.*/

public class Example8 {

    public static void main(String[] args){

        String[] letters = {"B","C","D","F","G","H","J","K","L","M","N","P","Q","R","S","T","V","W","X","Z"};

        System.out.print("[");

        for (int i = 0; i < 20; i++){

            if (i < 19){

                System.out.print(letters[i] + " " + "," + " ");

            } else {

                System.out.print(letters[i] + "]");

            }

        }

        System.out.println();

    }

}